thieu-b55/The---I-want-this---ESP32-S3-Internet-radio/Libraries/AsyncWebServer_ESP32_SC_W5500/src/AsyncWebServer_ESP32_SC_W5500.h
/****************************************************************************************************************************
  AsyncWebServer_ESP32_SC_W5500.h - Dead simple Ethernet AsyncWebServer.

  For W5500 LwIP Ethernet in ESP32_SC_W5500 (ESP32_S2/S3/C3 + W5500)

  AsyncWebServer_ESP32_SC_W5500 is a library for the LwIP Ethernet W5500 in ESP32_S2/S3/C3 to run AsyncWebServer

  Based on and modified from ESPAsyncWebServer (https://github.com/me-no-dev/ESPAsyncWebServer)
  Built by Khoi Hoang https://github.com/khoih-prog/AsyncWebServer_ESP32_SC_W5500
  Licensed under GPLv3 license

  Original author: Hristo Gochkov

  Copyright (c) 2016 Hristo Gochkov. All rights reserved.

  This library is free software; you can redistribute it and/or modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public License along with this library;
  if not, write to the Free Software Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

  Version: 1.8.1

  Version Modified By   Date      Comments
  ------- -----------  ---------- -----------
  1.6.3   K Hoang      15/12/2022 Initial porting for W5500 + ESP32_S3. Sync with AsyncWebServer_ESP32_W5500 v1.6.3
  1.7.0   K Hoang      19/12/2022 Add support to ESP32_S2_W5500 (ESP32_S2 + LwIP W5500)
  1.8.0   K Hoang      20/12/2022 Add support to ESP32_C3_W5500 (ESP32_C3 + LwIP W5500)
  1.8.1   K Hoang      23/12/2022 Remove unused variable to avoid compiler warning and error
 *****************************************************************************************************************************/

#ifndef _AsyncWebServer_ESP32_SC_W5500_H_
#define _AsyncWebServer_ESP32_SC_W5500_H_

/////////////////////////////////////////////////


/////////////////////////////////////////////////////////////

#if ( ARDUINO_ESP32S2_DEV || ARDUINO_FEATHERS2 || ARDUINO_ESP32S2_THING_PLUS || ARDUINO_MICROS2 || \
      ARDUINO_METRO_ESP32S2 || ARDUINO_MAGTAG29_ESP32S2 || ARDUINO_FUNHOUSE_ESP32S2 || \
      ARDUINO_ADAFRUIT_FEATHER_ESP32S2_NOPSRAM )
#if (_ETHERNET_WEBSERVER_LOGLEVEL_ > 3)
  #warning Using ESP32_S2. To follow library instructions to install esp32-s2 core and WebServer Patch
  #warning You have to select HUGE APP or 1.9-2.0 MB APP to be able to run Config Portal. Must use PSRAM
#endif

#define USING_ESP32_S2        true

#ifndef SHIELD_TYPE
  #define SHIELD_TYPE         "ESP32_S2_W5500"
#endif

#elif ( ARDUINO_ESP32C3_DEV )
#if (_ETHERNET_WEBSERVER_LOGLEVEL_ > 3)
  #if ( defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 2) )
    #warning Using ESP32_C3 using core v2.0.0+. Either LittleFS, SPIFFS or EEPROM OK.
  #else
    #warning Using ESP32_C3 using core v1.0.6-. To follow library instructions to install esp32-c3 core. Only SPIFFS and EEPROM OK.
  #endif

  #warning You have to select Flash size 2MB and Minimal APP (1.3MB + 700KB) for some boards
#endif

#define USING_ESP32_C3        true

#ifndef SHIELD_TYPE
  #define SHIELD_TYPE         "ESP32_C3_W5500"
#endif

#elif ( defined(ARDUINO_ESP32S3_DEV) || defined(ARDUINO_ESP32_S3_BOX) || defined(ARDUINO_TINYS3) || \
        defined(ARDUINO_PROS3) || defined(ARDUINO_FEATHERS3) )
#if (_ETHERNET_WEBSERVER_LOGLEVEL_ > 3)
  #warning Using ESP32_S3. To install esp32-s3-support branch if using core v2.0.2-
#endif

#define USING_ESP32_S3        true

#ifndef SHIELD_TYPE
  #define SHIELD_TYPE         "ESP32_S3_W5500"
#endif

#else
#error This code is intended to run on the ESP32_S2/3, ESP32_C3 platform! Please check your Tools->Board setting.
#endif

#define BOARD_NAME      ARDUINO_BOARD


/////////////////////////////////////////////////

#if ( ( defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 2) ) && ( ARDUINO_ESP32_GIT_VER != 0x46d5afb1 ) )
  #define USING_CORE_ESP32_CORE_V200_PLUS      true

  #if (_ASYNC_WEBSERVER_LOGLEVEL_ > 3 )
    #warning Using code for ESP32 core v2.0.0+ in AsyncWebServer_ESP32_SC_W5500.h
  #endif

  #define ASYNC_WEBSERVER_ESP32_SC_W5500_VERSION      "AsyncWebServer_ESP32_SC_W5500 v1.8.1 for core v2.0.0+"
#else

  #if (_ASYNC_WEBSERVER_LOGLEVEL_ > 3 )
    #warning Using code for ESP32 core v1.0.6- in AsyncWebServer_ESP32_SC_W5500.h
  #endif

  #define ASYNC_WEBSERVER_ESP32_SC_W5500_VERSION      "AsyncWebServer_ESP32_SC_W5500 v1.8.1 for core v1.0.6-"
#endif

#define ASYNC_WEBSERVER_ESP32_SC_W5500_VERSION_MAJOR     1
#define ASYNC_WEBSERVER_ESP32_SC_W5500_VERSION_MINOR     8
#define ASYNC_WEBSERVER_ESP32_SC_W5500_VERSION_PATCH     1

#define ASYNC_WEBSERVER_ESP32_SC_W5500_VERSION_INT       1008001

/////////////////////////////////////////////////

#ifndef ESP32_W5500_AWS_UNUSED
  #define ESP32_W5500_AWS_UNUSED(x)       (void)(x)
#endif

/////////////////////////////////////////////////

#include "Arduino.h"

#include <functional>
#include "FS.h"

#include "StringArray.h"

//////////////////////////////////////////////////////////////
// ESP32_SC_W5500 related code

#include "AsyncWebServer_ESP32_SC_W5500_Debug.h"

#include <WiFi.h>
#include <WebServer.h> // Introduce corresponding libraries

#include "w5500/esp32_sc_w5500.h"

#include <hal/spi_types.h>

//////////////////////////////////////////////////////////////

#if USING_ESP32_S3

  #if !defined(ETH_SPI_HOST)
    // Using SPI2 for ESP32_S3, but name is SPI3_HOST
    #define ETH_SPI_HOST        SPI3_HOST
  #endif

  #if !defined(SPI_CLOCK_MHZ)
    // Using 25MHz for W5500, 14MHz for W5100
    #define SPI_CLOCK_MHZ       25
  #endif

  #if !defined(INT_GPIO)
    #define INT_GPIO            4
  #endif

  #if !defined(MISO_GPIO)
    #define MISO_GPIO           13
  #endif

  #if !defined(MOSI_GPIO)
    #define MOSI_GPIO           11
  #endif

  #if !defined(SCK_GPIO)
    #define SCK_GPIO            12
  #endif

  #if !defined(CS_GPIO)
    #define CS_GPIO             10
  #endif

